# IsInstance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterDownloadOptions..::..IsInstance Property
ParameterDownloadOptions Class See Also
---
True if binding to Element instances, false if binding to Element types.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool IsInstance { get; set; }
```

Visual Basic
---
```text
Public Property IsInstance As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsInstance {
	bool get ();
	void set (bool value);
}
```

# See Also
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace